In [5]:
# Import as necessary
import requests
import pandas as pd

In [52]:
def get_omdb_list(film, year):
    response = requests.get('http://www.omdbapi.com/?', params = {'t': film, 'y': str(year)})
    my_list = ['BoxOffice']#, 'Rated', 'Genre', 'Ratings', 'Runtime', 'Released', 'Production', 'Director', 'Actors']
    newlist = []
    for thing in my_list:
        try:
            add = response.json()[thing]
            newlist.append(add)
        except:
            newlist.append('N/A')
    return [film, year] + newlist

In [6]:
# Load pickle file
df1 = pd.read_pickle('data_metacritic_cleaned.pkl')

In [21]:
df2 = (df1
       [['movie', 'rel_date']]
       .assign(year = df1['rel_date'].dt.year,
               movie = df1['movie'].str.replace('re-release]', '').str.replace('[', ''))
       .drop('rel_date', axis = 1))

#df2.head()

In [23]:
df2.head()

                       movie  year
0                  Quiz Show  1994
1               Juwanna Mann  2002
2  Oz the Great and Powerful  2013
3                   Gypsy 83  2004
4       Eyes Without a Face   2003

In [68]:
# 
test_movie_list = []

for i, row in df2.iterrows():
    movie = row[0]
    year = row[1]
    info = get_omdb_list(movie, year)
    
    test_movie_list.append(info)

df3 = pd.DataFrame(test_movie_list, columns = ['Movie', 'Year', 'Gross'])
print(df3.shape)

(5921, 3)

                       Movie  Year            Gross
0                  Quiz Show  1994              N/A
1               Juwanna Mann  2002   $13,434,906.00
2  Oz the Great and Powerful  2013  $234,903,076.00
3                   Gypsy 83  2004              N/A
4       Eyes Without a Face   2003              N/A

In [69]:
# Pickle results
df3.to_pickle('data_omdb.pkl')

In [73]:
df3.query('Gross != "N/A"').shape

(2691, 3)

In [72]:
df3.head()

                       Movie  Year            Gross
0                  Quiz Show  1994              N/A
1               Juwanna Mann  2002   $13,434,906.00
2  Oz the Great and Powerful  2013  $234,903,076.00
3                   Gypsy 83  2004              N/A
4       Eyes Without a Face   2003              N/A